package dataHelper;

import org.testng.annotations.DataProvider;

public class StaticProvider {

    /**
     * Как реализовать менее криво не рпидумал, зато работает!
     * @return
     */
    @DataProvider(name = "Check summary")
    public static Object[][] checkSummary(){
        return new Object[][]{
                { "11111111111111111111111111111111111111111111111111111111111111111111111111111111",
                  "11111111111111111111111111111111111111111111111111111111111111111111111111111111"},
                { "111111111111111111111111111111111111111111111111111111111111111111111111111111112",
                  "11111111111111111111111111111111111111111111111111111111111111111111111111111111" },
                { "","" }
        };
    }

}
